reminder = """\
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                             В Н И М А Н И Е !                             *
*     При пополнении БС:                                                    *
* 1. Проверяй, изменяются ли при этом условия применения шаблонов!          *
* 2. Проверяй, изменяются ли при этом специальные списки!                   *
* 3. При добавлении новых шаблонов внеси их также и в свод шаблонов!        *
*   Также в этом случае нужно модифицировать генератор словоформ.           *
* 4. Внеси СООТВЕТСТВУЮЩИЕ изменения в БГ! Помни при этом о Правилах        *
*   соотношения.                                                            *
* 5. Проверяй, не является ли добавляемое слово многокорневым!              *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                             В Н И М А Н И Е !                             *
*     При пополнении БГ:                                                    *
* 1. Проверяй, не является ли добавляемое слово многокорневым!              *
* 2. Внеси СООТВЕТСТВУЮЩИЕ изменения в БС! Помни при этом о Правилах        *
*   соотношения.                                                            *
* 3. Проверяй, изменяются ли при этом условия применения шаблонов!          *
* 4. Проверяй, изменяются ли при этом специальные списки!                   *
* 5. При добавлении новых шаблонов внеси их также и в свод шаблонов!        *
*   Также в этом случае нужно модифицировать генератор словоформ.           *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *\
"""

reminder_verbs = """\
ПРОВЕРЬТЕ на соблюдение следующего правила:
глаголы I спряжения, у которых единственная словоформа .ГНБ3мн
оканчивается на -ЖУТ, -ЧУТ, -ШУТ, -ЩУТ,
НЕ образуют ПНС!
Для продолжения нажмите Enter\
"""

reminder_nouns = """\
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                             В Н И М А Н И Е !                             *
*                 Порядок чисел, состоящих из арабских цифр,                *
*                     в создаваемом документе следующий:                    *
*              1 10 11 12 13 14 15 16 17 18 19 2 3 4 5 6 7 8 9              *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *\
"""
