reminder = """\
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                             В Н И М А Н И Е !                             *
*     При пополнении БС:                                                    *
* 1. Следи, чтобы в добавляемых СЛОВАХ не было заглавных букв и буквы Ёё!   *
* 2. Проверяй, не омонимично ли добавляемое слово присутствующим в БС       *
*   ЗС групп и одиночкам! Если да, проверяй, нужно ли добавить примечания!  *
* 3. Проверяй, изменяются ли при этом условия применения шаблонов!          *
* 4. Проверяй, изменяются ли при этом специальные списки!                   *
* 5. При добавлении новых шаблонов внеси их также и в свод шаблонов!        *
*   Также в этом случае нужно модифицировать генератор словоформ.           *
* 6. Внеси СООТВЕТСТВУЮЩИЕ изменения в БГ! Помни при этом о Правилах        *
*   соотношения.                                                            *
* 7. Проверяй, не является ли добавляемое слово многокорневым!              *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                             В Н И М А Н И Е !                             *
*     При пополнении БГ:                                                    *
* 1. Следи, чтобы в добавляемых СЛОВАХ не было заглавных букв и буквы Ёё!   *
* 2. Проверяй, не омонимично ли добавляемое слово присутствующим в БГ       *
*   словам! Если да, проверяй, нужно ли добавить примечания!                *
* 3. Проверяй, не является ли добавляемое слово многокорневым!              *
* 4. Внеси СООТВЕТСТВУЮЩИЕ изменения в БС! Помни при этом о Правилах        *
*   соотношения.                                                            *
* 5. Проверяй, изменяются ли при этом условия применения шаблонов!          *
* 6. Проверяй, изменяются ли при этом специальные списки!                   *
* 7. При добавлении новых шаблонов внеси их также и в свод шаблонов!        *
*   Также в этом случае нужно модифицировать генератор словоформ.           *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *\
"""
