reminder = """\
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                             В Н И М А Н И Е !                             *
*     При пополнении БС:                                                    *
* 1. Проверяй, изменяются ли при этом условия применения шаблонов!          *
* 2. Проверяй, изменяются ли при этом специальные списки!                   *
* 3. При добавлении новых шаблонов внеси их также и в свод шаблонов!        *
*   Также в этом случае нужно модифицировать генератор словоформ.           *
* 4. Внеси СООТВЕТСТВУЮЩИЕ изменения в БГ! Помни при этом о Правилах        *
*   соотношения.                                                            *
* 5. Проверяй, не является ли добавляемое слово многокорневым!              *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                             В Н И М А Н И Е !                             *
*     При пополнении БГ:                                                    *
* 1. Проверяй, не является ли добавляемое слово многокорневым!              *
* 2. Внеси СООТВЕТСТВУЮЩИЕ изменения в БС! Помни при этом о Правилах        *
*   соотношения.                                                            *
* 3. Проверяй, изменяются ли при этом условия применения шаблонов!          *
* 4. Проверяй, изменяются ли при этом специальные списки!                   *
* 5. При добавлении новых шаблонов внеси их также и в свод шаблонов!        *
*   Также в этом случае нужно модифицировать генератор словоформ.           *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *\
"""
